pcesar22/domes/firmware/domes/sdkconfig.defaults
# DOMES Firmware Configuration Defaults
# Target: ESP32-S3-DevKitC-1
CONFIG_IDF_TARGET="esp32s3"

# Console output via USB Serial/JTAG (native USB port)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Flash size (DevKitC-1 has 8MB, but we target 16MB for production)
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# FreeRTOS settings
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_USE_TRACE_FACILITY=y

# Main task stack size (default is 3584, keep reasonable)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_COLORS=y

# Task Watchdog Timer (TWDT)
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_INIT=n
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=n
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n

# Core dump for debugging
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y

# C++ exceptions disabled (per guidelines)
CONFIG_COMPILER_CXX_EXCEPTIONS=n

# RTTI disabled (per guidelines)
CONFIG_COMPILER_CXX_RTTI=n

# WiFi Configuration
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y

# WiFi + BLE Coexistence (required for ESP-NOW + BLE)
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y

# SmartConfig for WiFi provisioning
CONFIG_ESP_SMARTCONFIG_ENABLE=y

# HTTPS support for OTA
CONFIG_ESP_TLS_USING_MBEDTLS=y
CONFIG_MBEDTLS_SSL_MAX_CONTENT_LEN=16384
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# Bluetooth Low Energy (NimBLE)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
# NOTE: MAX_CONNECTIONS=1 is intentional. In multi-pod architecture,
# the phone connects to ONE master pod via BLE. The master uses ESP-NOW
# (not BLE) to communicate with slave pods.
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_MAX_BONDS=3
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=517
CONFIG_BT_NIMBLE_GAP_DEVICE_NAME_MAX_LEN=32
CONFIG_BT_NIMBLE_SVC_GAP_DEVICE_NAME="DOMES-Pod-INIT"
CONFIG_BT_NIMBLE_GATT_MAX_PROCS=4

# Pin BLE controller to Core 0 (protocol core) for better coexistence
CONFIG_BT_NIMBLE_PINNED_TO_CORE_0=y

# BLE connection parameters tuned for ESP-NOW coexistence.
# Wider intervals + slave latency reduce radio contention during game traffic.
# Units: 1.25ms per interval unit, 10ms per supervision timeout unit.
CONFIG_BT_NIMBLE_SVC_GAP_PPCP_MIN_CONN_INTERVAL=24
CONFIG_BT_NIMBLE_SVC_GAP_PPCP_MAX_CONN_INTERVAL=40
CONFIG_BT_NIMBLE_SVC_GAP_PPCP_SLAVE_LATENCY=4
CONFIG_BT_NIMBLE_SVC_GAP_PPCP_SUPERVISION_TMO=600

# Use scheduled CE length for better coexistence arbitration.
# "SD" lets the coex scheduler control BLE connection event duration,
# preventing BLE from monopolizing the radio during ESP-NOW bursts.
CONFIG_BT_CTRL_CE_LENGTH_TYPE_SD=y
